{
    "version": "https://jsonfeed.org/version/1",
    "title": "Clement Neo",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Blog",
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author": "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}",
    
"items": [
    
        {
            "id": "http://localhost:4000/posts/on-meta-questions",
            "title": "On Meta-Questions",
            "summary": null,
            "content_text": "The Limits of Introspective KnowledgeFor the past half year I’ve been stuck on these two questions:  What new skill or subject should I learn, outside of the university curriculum?  What should I write about on my blog?When trying to think about these questions, more questions pop up. For example, when trying to settle on trying to learn a new skill, the meta-question arises:  If I were to commit to learning a new skill, how do I know that it’s worth it? How do I quantitatively weigh these options?This cost-benefit analysis pays off when making decisions, especially because there is the opportunity cost associated with making that decision. But then the meta-meta question pops up:  As time passes by, the world around me changes. How do I know when to change my direction on what I should do?In thinking about all of these meta-questions, I became immobilized by all of the information and all of the uncertainty. A year on, I had made zero progress on the goals I had set for myself.These meta-questions are important in their own right. Having the answer to “What’s important in learning a skill? The potential career payoffs? How interesting it is?” can give important insight to what you value. But the resolving of these meta-questions only create internal value — they create introspective knowledge, but nothing else. What’s important is that they pave your way to continue on to solving actual problems.We have to be constantly mindful not to be stuck in the loop of the meta-questions. Introspection, as useful as it is, comes with the trap of the coastline paradox, where there is no end to to the questions you can ask. While thinking about deeper meta-questions can be enlightening, we have eventually settle for good enough, keep the Russian nested doll, and carry on with solving the actual problem we started with.Making Arbitrary DeclarationsIn light of this, sometimes making arbitrary declarations can be a nice way to solve the meta-question. For the question of “what should I learn in my free time?”, I’m settling on the following arbitrary declaration:  “Follow your curiosity” 9 Jun 21 @blakeirAnd on a similar note:  “If you’re trying to figure out what to do next, it’s better to follow your own genuine intellectual curiosity over whatever is “hot” right now.” 15 Jan 20 @navalAnd for the question of what I should write about this blog, I’m making the following arbitrary declaration:  It doesn’t matter. Just write what’s interesting for yourself.This was inspired by the essay Get Numb Before You Get Good, which argues that in writing, the difficulty with starting can be mostly attributed to the fear of starting, and not the challenge of thinking of good topics. There will never be something ‘good enough’ if I don’t get numb to the action of publishing first.Ultimately, arbitrary declarations don’t have to be strictly justified. They just have to be good enough. After all, you need to have a break in your while True loop.",
            "content_html": "<h2 id=\"the-limits-of-introspective-knowledge\">The Limits of Introspective Knowledge</h2><p>For the past half year I’ve been stuck on these two questions:</p><ol>  <li>What new skill or subject should I learn, outside of the university curriculum?</li>  <li>What should I write about on my blog?</li></ol><p>When trying to think about these questions, more questions pop up. For example, when trying to settle on trying to learn a new skill, the <strong>meta-question</strong> arises:</p><ul>  <li>If I were to commit to learning a new skill, how do I know that it’s worth it? How do I quantitatively weigh these options?</li></ul><p>This cost-benefit analysis pays off when making decisions, especially because there is the opportunity cost associated with making that decision. But then the <strong>meta-meta question</strong> pops up:</p><ul>  <li>As time passes by, the world around me changes. How do I know when to change my direction on what I should do?</li></ul><p>In thinking about all of these meta-questions, I became immobilized by all of the information and all of the uncertainty. A year on, I had made zero progress on the goals I had set for myself.</p><p>These meta-questions are important in their own right. Having the answer to “What’s important in learning a skill? The potential career payoffs? How interesting it is?” can give important insight to what you value. But the resolving of these meta-questions only create internal value — they create introspective knowledge, but nothing else. What’s important is that they pave your way to continue on to solving actual problems.</p><p>We have to be constantly mindful not to be stuck in the loop of the meta-questions. Introspection, as useful as it is, comes with the trap of the <a href=\"https://en.wikipedia.org/wiki/Coastline_paradox\">coastline paradox</a>, where there is no end to to the questions you can ask. While thinking about deeper meta-questions can be enlightening, we have eventually settle for good enough, keep the Russian nested doll, and carry on with solving the actual problem we started with.</p><h2 id=\"making-arbitrary-declarations\">Making Arbitrary Declarations</h2><p>In light of this, sometimes making arbitrary declarations can be a nice way to solve the meta-question. For the question of “what should I learn in my free time?”, I’m settling on the following arbitrary declaration:</p><blockquote>  <p>“Follow your curiosity” <a href=\"https://twitter.com/blakeir/status/1402655284242399235\">9 Jun 21 @blakeir</a></p></blockquote><p>And on a similar note:</p><blockquote>  <p>“If you’re trying to figure out what to do next, it’s better to follow your own genuine intellectual curiosity over whatever is “hot” right now.” <a href=\"https://twitter.com/naval/status/1217184799934140416\">15 Jan 20 @naval</a></p></blockquote><p>And for the question of what I should write about this blog, I’m making the following arbitrary declaration:</p><blockquote>  <p>It doesn’t matter. Just write what’s interesting for <em>yourself</em>.</p></blockquote><p>This was inspired by the essay <a href=\"https://commoncog.com/blog/get-numb-get-good/\">Get Numb Before You Get Good</a>, which argues that in writing, the difficulty with starting can be mostly attributed to the fear of starting, and not the challenge of thinking of good topics. There will never be something ‘good enough’ if I don’t get numb to the action of publishing first.</p><p>Ultimately, arbitrary declarations don’t have to be strictly justified. They just have to be good enough. After all, you need to have a <code class=\"language-plaintext highlighter-rouge\">break</code> in your <code class=\"language-plaintext highlighter-rouge\">while True</code> loop.</p>",
            "url": "http://localhost:4000/posts/on-meta-questions",
            
            
            
            
            
            "date_published": "2021-06-21T00:00:00+08:00",
            "date_modified": "2021-06-21T00:00:00+08:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/posts/collision-theory-of-life",
            "title": "The Collision Theory of Life",
            "summary": null,
            "content_text": "When I was a kid, I thought my career would be straightforward: graduate with a degree, get a job, work hard enough to earn a promotion, if not get a de facto promotion by job-hopping. But now I realise life can bring me anywhere. My career could transcend international borders, or I could be self-employed altogether.This is what made me think of the Collision Theory of life. Instead of my potential career being a Snakes and Ladders game, it would probably be more apt to think of it as a Plinko game.Part of this has been inspired by Nassim Nicholas Taleb’s Fooled by Randomness, which postulates that we overestimate the control we have over our lives, and that randomness plays a large part in our destinies. In Plinko, even when we do get to decide where to place the chip, we surrender the ultimate location of the chip to randomness and chance. Even if we do somehow manage to engineer the chip such that we could guarantee that it would fall a specific direction at the topmost level, the randomness of the rest of the board is still enough to significantly negate the effect of our initial direction.Hence Collision Theory is my way of trying to maximise the number of favourable slots at the end of the Plinko board, as opposed to trying to go for one specific slot.What is Collision Theory?In chemistry, collision theory states that for two molecules to react:  The molecules must be able to react with each other  The molecules must collide into each other with enough kinetic energy  The molecules must be in the correct spatial orientationIf all criteria are met, the molecules will successfully collide, that is, they will react. In a chemical reaction, a successful collision is the quanta of reaction, and it takes many of such collisions before we can say that the chemical reaction has fully taken place1.But in a chemical reaction, there are just so many molecules that we can’t know which specific molecules are successfully colliding at any one time, and as such we can’t dictate which molecules are colliding. But the specific molecules that are colliding at an instant is insignificant, because in the long run most of the molecules would have successfully collided and the reaction would have taken place.Similarly, successful collisions are like a favourable change in life. They are things like creating a startup, getting hired by a company that is sponsoring your visa, or getting a promotion. They often require the stars to line up — for a specific successful collision to happen, many prerequisites must be met. But at most times it would be inefficient to try to force a specific successful collision.The Collision Theory of life hence is trying to optimise your environment for successful collisions in general, and not just work towards one specific successful collision.How Collision Theory Works Out in LifePart of the Collision Theory of life can be extrapolated from the chemistry version of collision theory.In chemistry, you can increase the rate of reactions by increasing the concentration of reactants, or by adding a catalyst. Fundamentally, they both increase the frequency of successful collisions.Increasing the concentration of reactants would be equivalent to mixing with people that you’re more likely to successfully collide with. Placing yourself in such an environment can be advantageous — that’s why wildly successful startups often end up in Silicon Valley. The online equivalent would be to be active on Twitter (or any other appropriate platform) and engage with like-minded people.In some biological reactions, you need an enzyme catalyst to orient the molecules so that they can properly react. Without this catalyst to put them in the right place, the molecules will not be able to successfully collide. Similarly, some successful collisions in life have prerequisites. If I want to keep the option of doing a Software-as-a-Service startup open, then I should know software development and keep myself updated with the latest web frameworks.Learning programming or moving to Silicon Valley are ideas that already exist, but the key thing about Collision Theory is that these merely facilitate successful collisions; they do not guarantee that such successful collisions happen. The theory helps me keep in mind that whatever I’m doing might fail, and it also helps me think about the backup plans, and the backup-backup plans.How I Use Collision TheoryCollision Theory is a language I try to think in when deciding what I should do.Some careers, like medicine, are relatively straightforward and linear. But chances are present-me won’t be able to guess what I’ll be doing ten years later, since ten years is a lot of time filled with a lot of uncertainty. The further I look into the future, the more unqualified I think I am to comment on it. For the long run, broad goals are better than misguided, specific goals.I’ve had a three month break before I start university, and for the three months I’ve been trying to learn a bit of full-stack web development through The Odin Project. Three months isn’t enough to get good at web development, but for now I’m only trying to learn enough to be literate in the field of web development. If there happens to be a successful collision in the future where I create a web application, then I’m already in a position to learn the more complex portions of web development. I’m essentially trying to put myself in a position to enable that successful collision if the other stars ever line up.In this, I also use the Collision Theory for motivation. I tried to start learning web development two years back, and I gave up quite early on. It’s quite easy to run out of steam when trying to learn programming when you don’t urgently need to. You’re not doing it for something particularly tangible, so the motivation to continue learning sizzles out rather quickly. Collision Theory is the context I set for myself for learning web development, so that I can push on in the absence of a project.The more I try to think about the future, the greater my tendency to overthink things. There is just too much information and uncertainty involved. Ultimately, Collision Theory isn’t a guiding principle per se. It is my working mental model where I find certainty in uncertainty — that even though I can’t be sure that my current endeavours will bear fruit, they are nevertheless the best course of action.            I’m probably missing out on many details here. &#8617;      ",
            "content_html": "<p>When I was a kid, I thought my career would be straightforward: graduate with a degree, get a job, work hard enough to earn a promotion, if not get a de facto promotion by job-hopping. But now I realise life can bring me anywhere. My career could transcend international borders, or I could be self-employed altogether.</p><p>This is what made me think of the <strong>Collision Theory of life</strong>. Instead of my potential career being a <em>Snakes and Ladders</em> game, it would probably be more apt to think of it as a <em>Plinko</em> game.</p><p>Part of this has been inspired by Nassim Nicholas Taleb’s <em>Fooled by Randomness</em>, which postulates that we overestimate the control we have over our lives, and that randomness plays a large part in our destinies. In <em>Plinko</em>, even when we do get to decide where to place the chip, we surrender the ultimate location of the chip to randomness and chance. Even if we do somehow manage to engineer the chip such that we could guarantee that it would fall a specific direction at the topmost level, the randomness of the rest of the board is still enough to significantly negate the effect of our initial direction.</p><p>Hence Collision Theory is my way of trying to maximise the number of favourable slots at the end of the <em>Plinko</em> board, as opposed to trying to go for one specific slot.</p><h2 id=\"what-is-collision-theory\">What is Collision Theory?</h2><p>In chemistry, collision theory states that for two molecules to react:</p><ul>  <li>The molecules must be able to react with each other</li>  <li>The molecules must collide into each other with enough kinetic energy</li>  <li>The molecules must be in the correct spatial orientation</li></ul><p>If all criteria are met, the molecules will successfully collide, that is, they will react. In a chemical reaction, a successful collision is the quanta of reaction, and it takes many of such collisions before we can say that the chemical reaction has fully taken place<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>.</p><p>But in a chemical reaction, there are just so many molecules that we can’t know which specific molecules are successfully colliding at any one time, and as such we can’t dictate which molecules are colliding. But the specific molecules that are colliding at an instant is insignificant, because in the long run most of the molecules would have successfully collided and the reaction would have taken place.</p><p>Similarly, successful collisions are like a favourable change in life. They are things like creating a startup, getting hired by a company that is sponsoring your visa, or getting a promotion. They often require the stars to line up — for a specific successful collision to happen, many prerequisites must be met. But at most times it would be inefficient to try to force a specific successful collision.</p><p>The Collision Theory of life hence is trying to optimise your environment for successful collisions in general, and not just work towards one specific successful collision.</p><h2 id=\"how-collision-theory-works-out-in-life\">How Collision Theory Works Out in Life</h2><p>Part of the Collision Theory of life can be extrapolated from the chemistry version of collision theory.</p><p>In chemistry, you can increase the rate of reactions by increasing the concentration of reactants, or by adding a catalyst. Fundamentally, they both increase the frequency of successful collisions.</p><p>Increasing the concentration of reactants would be equivalent to mixing with people that you’re more likely to successfully collide with. Placing yourself in such an environment can be advantageous — that’s why wildly successful startups often end up in Silicon Valley. The online equivalent would be to be active on Twitter (or any other appropriate platform) and engage with like-minded people.</p><p>In some biological reactions, you need an enzyme catalyst to orient the molecules so that they can properly react. Without this catalyst to put them in the right place, the molecules will not be able to successfully collide. Similarly, some successful collisions in life have prerequisites. If I want to keep the option of doing a Software-as-a-Service startup open, then I should know software development and keep myself updated with the latest web frameworks.</p><p>Learning programming or moving to Silicon Valley are ideas that already exist, but the key thing about Collision Theory is that these merely facilitate successful collisions; they do not guarantee that such successful collisions happen. The theory helps me keep in mind that whatever I’m doing might fail, and it also helps me think about the backup plans, and the backup-backup plans.</p><h2 id=\"how-i-use-collision-theory\">How I Use Collision Theory</h2><p>Collision Theory is <strong>a language I try to think in</strong> when deciding what I should do.</p><p>Some careers, like medicine, are relatively straightforward and linear. But chances are present-me won’t be able to guess what I’ll be doing ten years later, since ten years is a lot of time filled with a lot of uncertainty. The further I look into the future, the more unqualified I think I am to comment on it. For the long run, broad goals are better than misguided, specific goals.</p><p>I’ve had a three month break before I start university, and for the three months I’ve been trying to learn a bit of full-stack web development through The Odin Project. Three months isn’t enough to get good at web development, but for now I’m only trying to learn enough to be <em>literate</em> in the field of web development. If there happens to be a successful collision in the future where I create a web application, then I’m already in a position to learn the more complex portions of web development. I’m essentially trying to put myself in a position to enable that successful collision if the other stars ever line up.</p><p>In this, I also use the Collision Theory for motivation. I tried to start learning web development two years back, and I gave up quite early on. It’s quite easy to run out of steam when trying to learn programming when you don’t urgently need to. You’re not doing it for something particularly tangible, so the motivation to continue learning sizzles out rather quickly. Collision Theory is the context I set for myself for learning web development, so that I can push on in the absence of a project.</p><p>The more I try to think about the future, the greater my tendency to overthink things. There is just too much information and uncertainty involved. Ultimately, Collision Theory isn’t a guiding principle per se. It is my working mental model where I find certainty in uncertainty — that even though I can’t be sure that my current endeavours will bear fruit, they are nevertheless the best course of action.</p><hr /><div class=\"footnotes\">  <ol>    <li id=\"fn:1\">      <p>I’m probably missing out on many details here. <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "http://localhost:4000/posts/collision-theory-of-life",
            
            
            
            
            
            "date_published": "2020-07-14T00:00:00+08:00",
            "date_modified": "2020-07-14T00:00:00+08:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        }
    
    ]
}